fsarwari/dscKeybusInterface/examples/esp8266/HomeAssistant-MQTT/src/main.cpp
// MQTT topics - match to Home Assistant's configuration.yaml
const char* mqttClientName = "dscKeybusInterface";
const char* mqttPartitionTopic = "dsc/Get/Partition";  // Sends armed and alarm status per partition: dsc/Get/Partition1 ... dsc/Get/Partition8
const char* mqttPartitionMessageSuffix = "/Message";   // Sends partition status messages: dsc/Get/Partition1/Message ... dsc/Get/Partition8/Message
const char* mqttZoneTopic = "dsc/Get/Zone";            // Sends zone status per zone: dsc/Get/Zone1 ... dsc/Get/Zone64
const char* mqttFireTopic = "dsc/Get/Fire";            // Sends fire status per partition: dsc/Get/Fire1 ... dsc/Get/Fire8
const char* mqttPgmTopic = "dsc/Get/PGM";              // Sends PGM status per PGM: dsc/Get/PGM1 ... dsc/Get/PGM14
const char* mqttTroubleTopic = "dsc/Get/Trouble";      // Sends trouble status
const char* mqttStatusTopic = "dsc/Status";            // Sends online/offline status
const char* mqttBirthMessage = "online";
const char* mqttLwtMessage = "offline";
const char* mqttSubscribeTopic = "dsc/Set";            // Receives messages to write to the panel

// Configures the Keybus interface with the specified pins - dscWritePin is optional, leaving it out disables the
// virtual keypad.
#define dscClockPin D1  // GPIO 5
#define dscReadPin  D2  // GPIO 4
#define dscPC16Pin  D7  // DSC Classic Series only, GPIO 13
#define dscWritePin D8  // GPIO 15

// Initialize components
#ifndef dscClassicSeries
dscKeybusInterface dsc(dscClockPin, dscReadPin, dscWritePin);
#else
dscClassicInterface dsc(dscClockPin, dscReadPin, dscPC16Pin, dscWritePin, accessCode);
#endif
WiFiClient ipClient;
PubSubClient mqtt(mqttServer, mqttPort, ipClient);
unsigned long mqttPreviousTime;

// NTP time synchronization settings
#ifndef ntpTimeZone
#define ntpTimeZone TZ_America_New_York  // Set the time zone (includes DST): https://github.com/esp8266/Arduino/blob/master/cores/esp8266/TZ.h
#endif
#ifndef ntpServer
const char* ntpServer = "pool.ntp.org";  // Set the NTP server (default)
#endif
#ifndef timePartition
#define timePartition 1  // Set the partition to use for setting the time
#endif

// NTP synchronization state
bool ntpSynced = true;
byte ntpOffset;
time_t ntpNow;
tm ntpTime;
time_t lastUpdatedTime = 0;
unsigned long ntpSyncAttemptTime = 0;  // Track when we last attempted sync
const unsigned long NTP_SYNC_RETRY_INTERVAL = 30000;  // Retry every 30 seconds if partition not ready

// Forward declarations
void mqttCallback(char* topic, byte* payload, unsigned int length);
void mqttHandle();
bool mqttConnect();
void appendPartition(const char* sourceTopic, byte sourceNumber, char* publishTopic);
void publishMessage(const char* sourceTopic, byte partition);

void setup() {
  Serial.begin(115200);
  delay(1000);
  Serial.println();
  Serial.println();

  Serial.print(F("WiFi...."));
  WiFi.mode(WIFI_STA);
  WiFi.hostname(wifiClientHostname);
  WiFi.begin(wifiSSID, wifiPassword);
  while (WiFi.status() != WL_CONNECTED) {
    Serial.print(".");
    delay(500);
  }
  Serial.print(F("connected: "));
  Serial.println(WiFi.localIP());

  // Initialize NTP time synchronization
  Serial.print(F("NTP time...."));
  configTime(ntpTimeZone, ntpServer);  // Initiates the NTP client, synced hourly
  time(&ntpNow);
  while (ntpNow < 1606784461) {  // Wait for valid NTP time (after 2020-12-01)
    Serial.print(".");
    delay(2000);
    time(&ntpNow);
  }
  Serial.print(F("synchronized: "));
  Serial.println(ctime(&ntpNow));

  mqtt.setCallback(mqttCallback);
  if (mqttConnect()) mqttPreviousTime = millis();
  else mqttPreviousTime = 0;

  // Starts the Keybus interface and optionally specifies how to print data.
  // begin() sets Serial by default and can accept a different stream: begin(Serial1), etc.
  dsc.begin();
  Serial.println(F("DSC Keybus Interface is online."));

  // Configure OTA updates
  ArduinoOTA.setHostname("dsc-keybus-esp8266");
  // Note: Empty password means no authentication required
  ArduinoOTA.setPassword("");  
  ArduinoOTA.setPort(8266);  // Explicitly set OTA port (default is 8266)
  ArduinoOTA.setRebootOnSuccess(true);  // Auto-reboot after successful update

  ArduinoOTA.onStart([]() {
    String type = (ArduinoOTA.getCommand() == U_FLASH) ? "sketch" : "filesystem";
    Serial.println();
    Serial.print("OTA Update starting: ");
    Serial.println(type);
    // Disconnect MQTT to free up resources during OTA
    mqtt.disconnect();
  });

  ArduinoOTA.onEnd([]() {
    Serial.println("\nOTA Update complete! Rebooting...");
  });

  ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
    Serial.printf("OTA Progress: %u%%\r", (progress * 100 / total));
  });

  ArduinoOTA.onError([](ota_error_t error) {
    Serial.println();
    Serial.printf("OTA Error[%u]: ", error);
    if (error == OTA_AUTH_ERROR) {
      Serial.println("Auth Failed - Check password");
    } else if (error == OTA_BEGIN_ERROR) {
      Serial.println("Begin Failed - Not enough space or invalid partition");
    } else if (error == OTA_CONNECT_ERROR) {
      Serial.println("Connect Failed");
    } else if (error == OTA_RECEIVE_ERROR) {
      Serial.println("Receive Failed - Network issue");
    } else if (error == OTA_END_ERROR) {
      Serial.println("End Failed - Flash write/verify failed. May need full erase via serial.");
      Serial.println("Try: pio run -t erase && pio run -t upload (via serial)");
    }
  });

  ArduinoOTA.begin();
  Serial.println(F("OTA server started"));
  
  // Start MDNS responder for hostname resolution
  if (MDNS.begin("dsc-keybus-esp8266")) {
    Serial.println(F("MDNS responder started"));
  }
  
  Serial.print(F("OTA Updates enabled on "));
  Serial.print(WiFi.localIP());
  Serial.println(F(":8266"));
}


void loop() {
  // Handle OTA first and frequently - it needs to respond quickly to incoming connections
  ArduinoOTA.handle();
  yield();  // Give WiFi stack time to process
  
  // Only process other tasks if OTA is not active
  if (!ArduinoOTA.getCommand()) {
    mqttHandle();
    dsc.loop();
    
    // Sets the time if not synchronized
    if (!ntpSynced) {
      time(&ntpNow);
      localtime_r(&ntpNow, &ntpTime);
      int ntpSecond = ntpTime.tm_sec;
      unsigned long currentTime = millis();

