fsarwari/dscKeybusInterface/examples/esp8266/HomeAssistant-MQTT/src/main.cpp
      // Try to sync at the offset second, or retry periodically if partition wasn't ready
      bool shouldSync = false;
      if (ntpSecond == ntpOffset) {
        shouldSync = true;
      } else if (ntpOffset > 55 && ntpSecond == 0) {
        shouldSync = true;
      } else if (ntpSyncAttemptTime > 0 && (currentTime - ntpSyncAttemptTime) >= NTP_SYNC_RETRY_INTERVAL) {
        // Retry if we've waited long enough and partition might be ready now
        shouldSync = true;
      }
      
      if (shouldSync) {
        int ntpYear = ntpTime.tm_year + 1900;
        int ntpMonth = ntpTime.tm_mon + 1;
        int ntpDay = ntpTime.tm_mday;
        int ntpHour = ntpTime.tm_hour;
        int ntpMinute = ntpTime.tm_min;
        
        // // if (dsc.ready[timePartition - 1]) {
        //   Serial.print(F("Setting time to: "));
        //   Serial.print(ntpYear);
        //   Serial.print(".");
        //   if (ntpMonth < 10) Serial.print("0");
        //   Serial.print(ntpMonth);
        //   Serial.print(".");
        //   if (ntpDay < 10) Serial.print("0");
        //   Serial.print(ntpDay);
        //   Serial.print(" ");
        //   if (ntpHour < 10) Serial.print("0");
        //   Serial.print(ntpHour);
        //   Serial.print(":");
        //   if (ntpMinute < 10) Serial.print("0");
        //   Serial.println(ntpMinute);
      }
    }
  } else {
    // OTA is active, prioritize it
    yield();
  }
  
  yield();  // Give WiFi stack time to process

  if (dsc.statusChanged) {      // Checks if the security system status has changed
    dsc.statusChanged = false;  // Reset the status tracking flag

    // If the Keybus data buffer is exceeded, the sketch is too busy to process all Keybus commands.  Call
    // loop() more often, or increase dscBufferSize in the library: src/dscKeybus.h or src/dscClassic.h
    if (dsc.bufferOverflow) {
      Serial.println(F("Keybus buffer overflow"));
      dsc.bufferOverflow = false;
    }

    // Checks for a panel timestamp and synchronizes with NTP if needed
    if (dsc.timestampChanged) {
      dsc.timestampChanged = false;
      Serial.print(F("Timestamp: "));
      Serial.print(dsc.year);                  // Returns year as a 4-digit unsigned int
      Serial.print(".");
      if (dsc.month < 10) Serial.print("0");
      Serial.print(dsc.month);                 // Returns month as a byte
      Serial.print(".");
      if (dsc.day < 10) Serial.print("0");
      Serial.print(dsc.day);                   // Returns day as a byte
      Serial.print(" ");
      if (dsc.hour < 10) Serial.print("0");
      Serial.print(dsc.hour);                  // Returns hour as a byte
      Serial.print(":");
      if (dsc.minute < 10) Serial.print("0");
      Serial.println(dsc.minute);              // Returns minute as a byte

      // Checks the current NTP time
      time(&ntpNow);
      localtime_r(&ntpNow, &ntpTime);
      int ntpYear = ntpTime.tm_year + 1900;
      int ntpMonth = ntpTime.tm_mon + 1;
      int ntpDay = ntpTime.tm_mday;
      int ntpHour = ntpTime.tm_hour;
      int ntpMinute = ntpTime.tm_min;
      int ntpSecond = ntpTime.tm_sec;



      // Print NTP time for comparison
      Serial.print(F("NTP time: "));
      Serial.print(ntpYear);
      Serial.print(".");
      if (ntpMonth < 10) Serial.print("0");
      Serial.print(ntpMonth);
      Serial.print(".");
      if (ntpDay < 10) Serial.print("0");
      Serial.print(ntpDay);
      Serial.print(" ");
      if (ntpHour < 10) Serial.print("0");
      Serial.print(ntpHour);
      Serial.print(":");
      if (ntpMinute < 10) Serial.print("0");
      Serial.print(ntpMinute);
      Serial.print(":");
      if (ntpSecond < 10) Serial.print("0");
      Serial.println(ntpSecond);

      // Checks if the time is synchronized
      bool timeDiffers = ( dsc.hour != ntpHour || dsc.minute != ntpMinute);
      // print dsc time before change:
      Serial.print(F("\nDSC Time: "));
      if (dsc.hour < 10) Serial.print("0");
      Serial.print(dsc.hour);
      Serial.print(":");
      if (dsc.minute < 10) Serial.print("0");
      Serial.println(dsc.minute);

      
      if (timeDiffers) {
        Serial.println(F("Time differs\n"));

        ntpOffset = ntpSecond;
        ntpSynced = false;
        // only update time if last updated time is more than 60 seconds ago
        if (ntpNow - lastUpdatedTime > 60 || lastUpdatedTime == 0) {
          Serial.println(F("Update time: "));

          // time reset string format: *6{mastercode}1hhmmMMDDYY#
          String timeEntry = String("*6") + String(accessCode) + String("1") + String(ntpHour) + String(ntpMinute) + String(ntpMonth) + String(ntpDay) + String(ntpYear) + String("#");
          Serial.printf("Time entry: %s\n", timeEntry.c_str());
          // dsc.write(timeEntry.c_str());
          // write one char at a time:
          for (int i = 0; i < timeEntry.length(); i++) {
            dsc.write(timeEntry[i]);
            delay(100);
          }
          // record last updated time
          lastUpdatedTime = ntpNow;
          Serial.printf("Last updated time: %s\n", ctime(&lastUpdatedTime));
        }

      } else {
        Serial.println(F("Time is synchronized."));
        ntpSynced = true;
      }
    }

    // Checks if the interface is connected to the Keybus
    if (dsc.keybusChanged) {
      dsc.keybusChanged = false;  // Resets the Keybus data status flag
      if (dsc.keybusConnected) mqtt.publish(mqttStatusTopic, mqttBirthMessage, true);
      else mqtt.publish(mqttStatusTopic, mqttLwtMessage, true);
    }

    // Sends the access code when needed by the panel for arming or command outputs
    if (dsc.accessCodePrompt) {
      dsc.accessCodePrompt = false;
      dsc.write(accessCode);
    }

    if (dsc.troubleChanged) {
      dsc.troubleChanged = false;  // Resets the trouble status flag
      if (dsc.trouble) mqtt.publish(mqttTroubleTopic, "1", true);
      else mqtt.publish(mqttTroubleTopic, "0", true);
    }

    // Publishes status per partition
    for (byte partition = 0; partition < dscPartitions; partition++) {

